Revit 2024 API
BuiltInFailures.SiteFailures.RegionPhaseMismatch Property
 Subregions must have the same Phase Created parameter and Phase Demolished parameter as the host Toposurface. Subregion phase will be set to match the Toposurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RegionPhaseMismatch { get; }
Visual Basic
Public Shared ReadOnly Property RegionPhaseMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RegionPhaseMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace